#!/usr/bin/perl

use strict;
use warnings;

$^I = ".bak";
while (<>) {
# Minúsculas
    s/\\'a/á/g;
    s/\\'e/é/g;
    s/\\'i/í/g;
    s/\\'o/ó/g;
    s/\\'u/ú/g;

    s/\\`a/à/g;
    s/\\`e/è/g;
    s/\\`i/ì/g;
    s/\\`o/ò/g;
    s/\\`u/ù/g;

    s/\\\^a/â/g;
    s/\\\^e/ê/g;
    s/\\\^i/î/g;
    s/\\\^o/ô/g;
    s/\\\^u/û/g;

    s/\\~a/ã/g;
    s/\\~e/ẽ/g;
    s/\\~i/ĩ/g;
    s/\\~o/õ/g;
    s/\\~u/ũ/g;

    s/\\"a/ä/g;
    s/\\"e/ë/g;
    s/\\"i/ï/g;
    s/\\"o/ö/g;
    s/\\"u/ü/g;

    s/\\'\{a\}/á/g;
    s/\\'\{e\}/é/g;
    s/\\'\{i\}/í/g;
    s/\\'\{o\}/ó/g;
    s/\\'\{u\}/ú/g;

    s/\\`\{a\}/à/g;
    s/\\`\{e\}/è/g;
    s/\\`\{i\}/ì/g;
    s/\\`\{o\}/ò/g;
    s/\\`\{u\}/ù/g;

    s/\\\^\{a\}/â/g;
    s/\\\^\{e\}/ê/g;
    s/\\\^\{i\}/î/g;
    s/\\\^\{o\}/ô/g;
    s/\\\^\{u\}/û/g;

    s/\\~\{a\}/ã/g;
    s/\\~\{e\}/ẽ/g;
    s/\\~\{i\}/ĩ/g;
    s/\\~\{o\}/õ/g;
    s/\\~\{u\}/ũ/g;

    s/\\"\{a\}/ä/g;
    s/\\"\{e\}/ë/g;
    s/\\"\{i\}/ï/g;
    s/\\"\{o\}/ö/g;
    s/\\"\{u\}/ü/g;

# Maiúsculas    
    s/\\'A/Á/g;
    s/\\'E/É/g;
    s/\\'I/Í/g;
    s/\\'O/Ó/g;
    s/\\'U/Ú/g;

    s/\\`A/À/g;
    s/\\`E/È/g;
    s/\\`I/Ì/g;
    s/\\`O/Ò/g;
    s/\\`U/Ù/g;

    s/\\\^A/Â/g;
    s/\\\^E/Ê/g;
    s/\\\^I/Î/g;
    s/\\\^O/Ô/g;
    s/\\\^U/Û/g;

    s/\\~A/Ã/g;
    s/\\~E/Ẽ/g;
    s/\\~I/Ĩ/g;
    s/\\~O/Õ/g;
    s/\\~U/Ũ/g;

    s/\\"A/Ä/g;
    s/\\"E/Ë/g;
    s/\\"I/Ï/g;
    s/\\"O/Ö/g;
    s/\\"U/Ü/g;

    s/\\'\{A\}/Á/g;
    s/\\'\{E\}/É/g;
    s/\\'\{I\}/Í/g;
    s/\\'\{O\}/Ó/g;
    s/\\'\{U\}/Ú/g;

    s/\\`\{A\}/À/g;
    s/\\`\{E\}/È/g;
    s/\\`\{I\}/Ì/g;
    s/\\`\{O\}/Ò/g;
    s/\\`\{U\}/Ù/g;

    s/\\\^\{A\}/Â/g;
    s/\\\^\{E\}/Ê/g;
    s/\\\^\{I\}/Î/g;
    s/\\\^\{O\}/Ô/g;
    s/\\\^\{U\}/Û/g;

    s/\\~\{A\}/Ã/g;
    s/\\~\{E\}/Ẽ/g;
    s/\\~\{I\}/Ĩ/g;
    s/\\~\{O\}/Õ/g;
    s/\\~\{U\}/Ũ/g;

    s/\\"\{A\}/Ä/g;
    s/\\"\{E\}/Ë/g;
    s/\\"\{I\}/Ï/g;
    s/\\"\{O\}/Ö/g;
    s/\\"\{U\}/Ü/g;


# Misc
    s/\\c c/ç/g;
    s/\\c\{c\}/ç/g;
    #s/\\ae/æ/g;
    #s/\\AE/Æ/g;
    #s/\\o/ø/g;
    #s/\\O/Ø/g;
    #s/~'/¡/g;
    #s/\\ss/ß/g;
    #s/\\aa/å/g;
    #s///;

# Encoding
    #s/usepackage(\[?.*\]?)\{inputenc\}/usepackage\[latin1\]\{inputenc\}/;

    print;
}
